export const state = () => {
  return {
    flatList: [
      {
        "id": "1",
        "photo": "flat_1.jpg",
        "price": 18500,
        "address": "вул. Івана Франка, 27",
        "city_region": "Галицький, Львів",
        "area": 55,
        "rooms_num": '2',
        "floor": 1,
        "rent_period": "довготривала",
        "owner": {
          "name": "Максим Іванович Куйбіда",
          "rating": 9.1,
          "tag": "перевірений",
          "phone_number": "+380967777777",
          "reviews": [{"name": "Іван", "review": "Все було супер швидко та професійно!"}]
        },
        "tags": ["Поруч садок", "Центр міста", "Поруч міський транспорт"],
        "description": "Затишна квартира з ремонтом та сучасними меблями. У кімнаті розміщені два розкладні дивани, журнальний столик, плазма, шафа для речей. Кухня облаштована шафами для посуду, барною стійкою зі стільцями, варильною поверхнею, духовою шафою, пральною машиною. Перевагою квартири є індивідуальне опалення, що допоможе заощадити на оплаті комунальних послуг. Будинок має вдале розташування: неподалік центру міста, поряд розвинута інфраструктура, магазини, дитячий садок зручна транспортна розв’язка."
      },


      {
        "id": "2",
        "photo": "Flats/2.jpg",
        "price": 23700,
        "address": "вул. Сельських, 7",
        "city_region": "Франківський, Львів",
        "area": 48,
        "rooms_num": '1',
        "floor": 6,
        "rent_period": "довготривала",
        "owner": {
          "name": "Степан Євгенович Лисак",
          "rating": 8.7,
          "tag": "не перевірений",
          "phone_number": "+380967777777",
          "reviews": [{"name": "Олена", "review": "Власник показав нам квартиру на наступний день. Все чудово!"}]
        },
        "tags": ["Поруч школа", "Поруч міський транспорт", "Тихий район"],
        "description": "Довгострокова оренда затишної однокімнатної квартири в новобудові на шостому поверсі з шести. Розташована в ближньому центрі, тихий розвинений район зі зручною транспортною розв'язкою. Зроблений якісний ремонт, сучасне функціональне меблювання кімнат та кухонного простору, дві гардеробні кімнати, балкон, панорамні вікна. "
      },


      {
        "id": "3",
        "photo": "Flats/3.jpg",
        "price": 3200,
        "address": "вул. Героїв Упа, 73",
        "city_region": "Франківський, Львів",
        "area": 78,
        "rooms_num": '3',
        "floor": 3,
        "rent_period": "подобова",
        "owner": {
          "name": "Олена Іванівна Косак",
          "rating": 2.7,
          "tag": "шахрай",
          "phone_number": "+380967777777",
          "reviews": [{"name": "Максим", "review": "Завищені ціни і власник хотів з нас предоплату! Обережно - шахрайка!"}]
        },
        "tags": ["Поруч міський транспорт", "Тихий район"],
        "description": "вул. Героїв Упа, 73 Франківський район 3200/доба Оренда квартири 3 кімнати"
      },


      {
        "id": "4",
        "photo": "Flats/4.jpg",
        "price": 1200,
        "address": "вул. Євгена Коновальця, 23",
        "city_region": "Франківський, Львів",
        "area": 58,
        "rooms_num": '2',
        "floor": 2,
        "rent_period": "подобова",
        "owner": {
          "name": "Євген Остапович Мазур",
          "rating": 7.5,
          "tag": "перевірений",
          "phone_number": "+380967777777",
          "reviews": [{"name": "Остап", "review": "Все супер, власник порядний!"}]
        },
        "tags": ["Поруч міський транспорт", "Тихий район", "Поруч школа"],
        "description": "Затишна квартира преміум класу-з двома ізольованими кімнатами поблизу центра міста. У квартирі замурований дизайнерський хороший ремонт. Є все для комфортного проживання. Відмінна інфраструктура."
      }
    ],
    selectedApartment : []
  }
}

export const getters = {
  flatList (state) {
    return state.flatList
  },
  selectedList (state) {
    return state.selectedApartment
  }
}

export const mutations = {
  addToSelected (state, apartment) {
    state.selectedApartment.push(apartment)
  },
  removeFromSelected (state,id) {
    const index = state.selectedApartment.findIndex(el => {
      return el === id
    })
    state.selectedApartment.splice(index, 1)
  }
}
